load-test.yml
config:
  target: "http://localhost:8080" # This is your Booking Service 
  phases:
    - duration: 60          # How long the test lasts (seconds)
      arrivalRate: 5        # Start with 5 new users every second
      rampTo: 50            # Gradually increase to 50 users per second 
      name: "Ramping up the load"
scenarios:
  - name: "Book a ticket"
    flow:
      - put:                # Your DOCKER.md says the endpoint is a PUT 
          url: "/ticket"
          expect:
            - statusCode: 200 # We expect success!